load_injection_scripts/ab/test1000-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   23.791 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      473000 bytes
HTML transferred:       241000 bytes
Requests per second:    42.03 [#/sec] (mean)
Time per request:       23.791 [ms] (mean)
Time per request:       23.791 [ms] (mean, across all concurrent requests)
Transfer rate:          19.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     9   24  20.0     15     199
Waiting:        8   23  20.0     14     198
Total:          9   24  20.0     15     199

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     17
  75%     18
  80%     38
  90%     56
  95%     58
  98%     74
  99%     98
 100%    199 (longest request)