load_injection_scripts/ab/test1000-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   13.066 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      269000 bytes
HTML transferred:       38000 bytes
Requests per second:    76.54 [#/sec] (mean)
Time per request:       13.066 [ms] (mean)
Time per request:       13.066 [ms] (mean, across all concurrent requests)
Transfer rate:          20.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.3      0     103
Processing:     6   13  15.8      7     175
Waiting:        6   12  15.9      7     175
Total:          6   13  16.1      8     175

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      9
  80%      9
  90%     37
  95%     51
  98%     63
  99%     84
 100%    175 (longest request)