load_injection_scripts/ab/test200-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   4.379 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      94600 bytes
HTML transferred:       48200 bytes
Requests per second:    45.67 [#/sec] (mean)
Time per request:       21.895 [ms] (mean)
Time per request:       21.895 [ms] (mean, across all concurrent requests)
Transfer rate:          21.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     8   22  24.0     10     143
Waiting:        8   21  24.0      9     143
Total:          8   22  24.0     10     144

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     14
  80%     51
  90%     53
  95%     67
  98%     92
  99%    142
 100%    144 (longest request)