load_injection_scripts/ab/test200-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   3.177 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      53800 bytes
HTML transferred:       7600 bytes
Requests per second:    62.95 [#/sec] (mean)
Time per request:       15.886 [ms] (mean)
Time per request:       15.886 [ms] (mean, across all concurrent requests)
Transfer rate:          16.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   7.2      0     102
Processing:     7   15  16.7      8      91
Waiting:        7   15  16.8      8      91
Total:          7   16  18.1      8     112

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     10
  80%     11
  90%     50
  95%     52
  98%     69
  99%     92
 100%    112 (longest request)