load_injection_scripts/ab/test2000-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   24.919 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      538000 bytes
HTML transferred:       76000 bytes
Requests per second:    80.26 [#/sec] (mean)
Time per request:       12.459 [ms] (mean)
Time per request:       12.459 [ms] (mean, across all concurrent requests)
Transfer rate:          21.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.9      0     102
Processing:     6   12  14.4      7     183
Waiting:        6   12  14.4      7     183
Total:          6   12  14.9      8     183

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      9
  80%      9
  90%     26
  95%     50
  98%     53
  99%     68
 100%    183 (longest request)