load_injection_scripts/ab/test300-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   8.374 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      141900 bytes
HTML transferred:       72300 bytes
Requests per second:    35.82 [#/sec] (mean)
Time per request:       27.915 [ms] (mean)
Time per request:       27.915 [ms] (mean, across all concurrent requests)
Transfer rate:          16.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     9   28  29.8     14     198
Waiting:        8   27  29.8     13     198
Total:          9   28  29.9     14     198

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     17
  75%     31
  80%     52
  90%     63
  95%     93
  98%    107
  99%    185
 100%    198 (longest request)