load_injection_scripts/ab/test300-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   4.337 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      80700 bytes
HTML transferred:       11400 bytes
Requests per second:    69.18 [#/sec] (mean)
Time per request:       14.455 [ms] (mean)
Time per request:       14.455 [ms] (mean, across all concurrent requests)
Transfer rate:          18.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     6   14  19.0      8     191
Waiting:        6   14  19.1      8     191
Total:          6   14  19.0      8     192

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%     10
  90%     48
  95%     51
  98%     77
  99%     92
 100%    192 (longest request)