load_injection_scripts/ab/test400-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   9.009 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      189200 bytes
HTML transferred:       96400 bytes
Requests per second:    44.40 [#/sec] (mean)
Time per request:       22.522 [ms] (mean)
Time per request:       22.522 [ms] (mean, across all concurrent requests)
Transfer rate:          20.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     9   22  18.0     14      94
Waiting:        9   22  17.9     14      93
Total:          9   22  18.0     15      94

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     16
  75%     18
  80%     44
  90%     55
  95%     59
  98%     63
  99%     85
 100%     94 (longest request)