load_injection_scripts/ab/test400-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   5.255 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      107600 bytes
HTML transferred:       15200 bytes
Requests per second:    76.12 [#/sec] (mean)
Time per request:       13.137 [ms] (mean)
Time per request:       13.137 [ms] (mean, across all concurrent requests)
Transfer rate:          20.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     6   13  15.6      8     102
Waiting:        6   13  15.6      7     102
Total:          6   13  15.6      8     102

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      9
  80%      9
  90%     48
  95%     51
  98%     59
  99%     95
 100%    102 (longest request)